In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

# Common Aggregation Functions

In [3]:
df.groupby("Department")["Salary"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [5]:
df.groupby("Team")["Salary"].mean()

Team
A    87.5
B    81.5
C    90.0
D    77.5
Name: Salary, dtype: float64

In [6]:
df.groupby("Gender")["Salary"].mean()

Gender
F    85.75
M    82.50
Name: Salary, dtype: float64

In [8]:
type(df.groupby("Team")["Salary"].mean())

pandas.core.series.Series

In [9]:
df.groupby("Team")["Salary"].sum()

Team
A    175
B    163
C    180
D    155
Name: Salary, dtype: int64

In [10]:
df.groupby("Team")["Salary"].min()

Team
A    85
B    78
C    88
D    75
Name: Salary, dtype: int64

In [11]:
df.groupby("Team")["Salary"].max()

Team
A    90
B    85
C    92
D    80
Name: Salary, dtype: int64

In [13]:
df.groupby("Department")["Salary"].max()

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

In [14]:
df.groupby("Team")["Salary"].count()

Team
A    2
B    2
C    2
D    2
Name: Salary, dtype: int64

# Custom Aggregation Function

In [15]:
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])

      mean  max  min
Team
A     87.5   90   85
B     81.5   85   78
C     90.0   92   88
D     77.5   80   75

In [17]:
type(df.groupby("Team")["Salary"].agg(["mean", "max", "min"]))
#its data frame but previous one was series

pandas.core.frame.DataFrame

In [18]:
#Renaming column according to my wish 
df.groupby("Team")["Salary"].agg(
    avg_score="mean",
    high_score="max"
)

      avg_score  high_score
Team
A          87.5          90
B          81.5          85
C          90.0          92
D          77.5          80

In [20]:
# Group the dataframe by the "Team" column and apply different aggregation functions:
# - Calculate the mean salary for each team
# - Find the maximum age for each team
df.groupby("Team").agg({
    "Salary": "mean",  # Calculate average salary per team
    "Age": "max"       # Find oldest player in each team
})

      Salary  Age
Team
A       87.5   25
B       81.5   30
C       90.0   28
D       77.5   27

In [25]:
# New column is created using some columns data and a common transformation
# Group by "Team" column, calculate mean "Salary" for each team, and assign this value
# to all rows of the same team using transform() method
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")
df["Team Avg"]  # Display the newly created column

0    87.5
1    87.5
2    81.5
3    81.5
4    90.0
5    90.0
6    77.5
7    77.5
Name: Team Avg, dtype: float64

# Filter Data

In [28]:
# Filter groups where the mean salary is greater than 80
# First groups the dataframe by "Team" column
# Then applies a filter to keep only groups where the average salary exceeds 80
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0